<template>
  <h1>我們為什麼要「膜拜阿雷電神」?</h1>

  <h1>起源</h1>

  <p>
    自古以來，人類對自然力量的敬畏，特別是對掌控降雨的雷神與雨神，有著深厚的信仰。人們認為雷神與雨神掌管著天上的水庫，他們的喜怒哀樂直接影響著地上的豐饒與枯竭。因此，為了祈求豐沛的雨水，滋潤大地、促進作物生長，世界各地的文明都發展出獨特的儀式與信仰。
  </p>

  <img
    src="https://upload.wikimedia.org/wikipedia/commons/6/6b/George_Catlin_-_Rainmaking_among_the_Mandan_-_1985.66.476_-_Smithsonian_American_Art_Museum.jpg"
  />

  <p>
    上圖為George Catlin 的畫作《Mandan 祈雨》:19世紀30年代，美國畫家 George
    Catlin
    在深入北美大平原時，目睹了曼丹族（Mandan）進行盛大的祈雨儀式，並將這一場景生動地記錄在他的畫作中。這幅畫作不僅僅是一幅藝術品，更是一份珍貴的歷史文件，為我們揭示了北美原住民對自然、對神靈的深刻信仰。
  </p>

  <h1>從田野到鍵盤，信仰的轉變</h1>

  <p>
    從傳統農業時代的農民祈求雨神賜予豐收，到現代科技時代的程式設計師「祈求」程式碼順利運行，信仰的對象雖然改變了，但人類對於未知、對於掌控的力量的渴望卻是亙古不變的。
  </p>

  <p>
    在程式設計的世界裡，「降雨」的意義被重新定義。程式碼的順利運行，就像是一場及時的「降雨」，能夠解決問題、創造價值。而那些能夠寫出優質程式碼的程式設計師，就如同掌握著「降雨」之力的「阿雷電神」。
  </p>

  <p>
    從傳統農業時代的雷神信仰，到現代科技時代的程式設計師對「阿雷電神」的崇拜，我們可以看出，人類對於未知的探索和對掌控力量的渴望是永恆不變的。儘管時代變遷，但信仰的本質卻是相通的。在這個電光石火的數位時代，「阿雷電神」的形象不僅僅是一個神話，更代表著人類對科技的無限憧憬。
  </p>

  <p>
    <RouterLink to="/howto"> (了解如何膜拜阿雷電神) </RouterLink>
  </p>
</template>

<style scoped>
img {
  width: 100%;
}
</style>
